/*
 * @Descripttion: 中间大屏--底部数据
 * @Author: JayShen
 * @Date: 2021-03-19 10:57:13
 * @LastEditors: JayShen
 * @LastEditTime: 2021-03-19 11:34:46
 */
// 中间屏-
export const centerBottomData = (data = [
    ['行1列1', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2'],
    ['行1列1', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2'],
    ['行1列1', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2'],
    ['行1列1', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2', '行1列3', '行1列2']
]) => ({
    header: ['需求单号', '版单', '报价', '款号', '颜色', "设计师", "版房", '工艺', '核价', '期货订单号', '模式', '审核', '放码', '物料', '采购', '生产分配', '外发', '工厂', '裁数', '出货', '验收', '入库 '],
    headerBGC: 'rgba(14,27,57,0.80)',
    oddRowBGC: '#163355',
    evenRowBGC: '',
    align: ['center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', 'center', ],
    data: data
})